src/corners/sanity/KBsTaprootWishlist.org
:PROPERTIES:
:ID:       D417EAF4-A0E0-4B39-B56F-ED8FBE41A527
:END:
#+TITLE: Taproot Wishlist
#+AUTHOR: Sanity

* David
- [ ] Remove helvetica from equations.
- [X] Add admonition-style blocks
- [ ] Add inline tag support
- [X] Render file tags in a pretty info block manner (sorta like the stub warnings on Wikipedia)
- [ ] Checkbox and TODO support
- [ ] Make =#include= statements not disappear
- [ ] Make updating the website easier
** Higher-level
- [ ] Improve "shared notetaking experience"
  - [ ] Coherent naming scheme
  - [ ] Easy switch between different people's notes on same subject
  - [ ] Transclusion support? 
- [ ] Decentralize
- [ ] Extensibility?
- [ ] Enforce the absolute minimum amount of things.
