docs/corners/sanity/KBsTaprootWishlist.tex
% Created 2021-09-29 Wed 07:31
% Intended LaTeX compiler: xelatex
\documentclass[letterpaper]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\setlength{\parindent}{0pt}
\usepackage[margin=1in]{geometry}
\usepackage{fontspec}
\usepackage{svg}
\usepackage{cancel}
\usepackage{indentfirst}
\setmainfont[ItalicFont = LiberationSans-Italic, BoldFont = LiberationSans-Bold, BoldItalicFont = LiberationSans-BoldItalic]{LiberationSans}
\newfontfamily\NHLight[ItalicFont = LiberationSansNarrow-Italic, BoldFont       = LiberationSansNarrow-Bold, BoldItalicFont = LiberationSansNarrow-BoldItalic]{LiberationSansNarrow}
\newcommand\textrmlf[1]{{\NHLight#1}}
\newcommand\textitlf[1]{{\NHLight\itshape#1}}
\let\textbflf\textrm
\newcommand\textulf[1]{{\NHLight\bfseries#1}}
\newcommand\textuitlf[1]{{\NHLight\bfseries\itshape#1}}
\usepackage{fancyhdr}
\pagestyle{fancy}
\usepackage{titlesec}
\usepackage{titling}
\makeatletter
\lhead{\textbf{\@title}}
\makeatother
\rhead{\textrmlf{Compiled} \today}
\lfoot{\theauthor\ \textbullet \ \textbf{2021-2022}}
\cfoot{}
\rfoot{\textrmlf{Page} \thepage}
\renewcommand{\tableofcontents}{}
\titleformat{\section} {\Large} {\textrmlf{\thesection} {|}} {0.3em} {\textbf}
\titleformat{\subsection} {\large} {\textrmlf{\thesubsection} {|}} {0.2em} {\textbf}
\titleformat{\subsubsection} {\large} {\textrmlf{\thesubsubsection} {|}} {0.1em} {\textbf}
\setlength{\parskip}{0.45em}
\renewcommand\maketitle{}
\author{Sanity}
\date{\today}
\title{Taproot Wishlist}
\hypersetup{
 pdfauthor={Sanity},
 pdftitle={Taproot Wishlist},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\tableofcontents


\section{David}
\label{sec:org9b3d920}
\begin{itemize}
\item[{$\square$}] Remove helvetica from equations.
\item[{$\boxtimes$}] Add admonition-style blocks
\item[{$\square$}] Add inline tag support
\item[{$\boxtimes$}] Render file tags in a pretty info block manner (sorta like the stub warnings on Wikipedia)
\item[{$\square$}] Checkbox and TODO support
\item[{$\square$}] Make \texttt{\#include} statements not disappear
\item[{$\square$}] Make updating the website easier
\end{itemize}
\subsection{Higher-level}
\label{sec:org457e286}
\begin{itemize}
\item[{$\square$}] Improve "shared notetaking experience"
\begin{itemize}
\item[{$\square$}] Coherent naming scheme
\item[{$\square$}] Easy switch between different people's notes on same subject
\item[{$\square$}] Transclusion support?
\end{itemize}
\item[{$\square$}] Decentralize
\item[{$\square$}] Extensibility?
\item[{$\square$}] Enforce the absolute minimum amount of things.
\end{itemize}
\end{document}
